{
  "version": "1.0",
  "truncation": null,
  "padding": null,
  "added_tokens": [
    {
      "id": 0,
      "content": "[UNK]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 1,
      "content": "[PAD]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 2,
      "content": "[CLS]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 3,
      "content": "[SEP]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 4,
      "content": "[MASK]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    }
  ],
  "normalizer": {
    "type": "Sequence",
    "normalizers": []
  },
  "pre_tokenizer": {
    "type": "ByteLevel",
    "add_prefix_space": true,
    "trim_offsets": true,
    "use_regex": true
  },
  "post_processor": null,
  "decoder": null,
  "model": {
    "type": "WordPiece",
    "unk_token": "[UNK]",
    "continuing_subword_prefix": "##",
    "max_input_chars_per_word": 100,
    "vocab": {
      "[UNK]": 0,
      "[PAD]": 1,
      "[CLS]": 2,
      "[SEP]": 3,
      "[MASK]": 4,
      ".": 5,
      "A": 6,
      "B": 7,
      "C": 8,
      "a": 9,
      "b": 10,
      "c": 11,
      "d": 12,
      "e": 13,
      "Ġ": 14,
      "##A": 15,
      "##a": 16,
      "##b": 17,
      "##C": 18,
      "##e": 19,
      "##c": 20,
      "##B": 21,
      "##d": 22,
      "##cc": 23,
      "##dd": 24,
      "##bb": 25,
      "Ġcc": 26,
      "Ġdd": 27,
      "##CC": 28,
      "##ee": 29,
      "Ġccc": 30,
      "Ġddd": 31,
      "ĠA": 32,
      "ĠB": 33,
      "Ġbb": 34,
      "ĠCC": 35,
      "Ġee": 36,
      "##aa": 37,
      "ĠAaa": 38,
      "ĠBbb": 39,
      "Ġbbb": 40,
      "ĠCCC": 41,
      "Ġeee": 42
    }
  }
}